# Pandas Introduction

### Importing Pandas Library

In [ ]:
import pandas as pd

### Dataframes and Series

### Series

In [ ]:
labels = ['a','b','c']
my_list = [10,20,30]
#arr = np.array(my_list)

data = {
   'a':10,
    'b':20,
    'c':30
}

In [ ]:
pd.Series(data=my_list)

In [ ]:
pd.Series(data=my_list, index=labels)

### DataFrame

In [59]:
# Example 1

from numpy.random import randn

df = pd.DataFrame(randn(5,4), index='A B C D E'.split(), columns='W X Y Z'.split())
df

          W         X         Y         Z
A -1.065252 -1.830896 -0.206330  1.341818
B -0.550727 -1.526892  0.597992 -0.317633
C -1.056278 -0.111261 -0.314968 -1.194915
D  2.665184  0.189561 -1.653943  0.677174
E  0.416977 -0.742625  0.021105 -0.551192

# Data Manipulation

### Accessing items

In [61]:
# Using loc

df.loc['D','W']

2.6651836470667973

In [63]:
# using iloc

df.iloc[3,0]

2.6651836470667973

In [ ]:
df['Y']['C']

### Adding a New Column

In [ ]:
df['New'] =df['W']+df['X']
df

### Dropping a Column

In [ ]:
df.drop("New", axis=1, inplace=False)

In [ ]:
df.drop("E" , axis=0,inplace=True)
df

## Dealing with missing Values

In [31]:
# Example 2
import numpy as np

df = pd.DataFrame({'A':[1,np.nan, 2, np.nan],
                  'B':[5, np.nan,np.nan,6],
                  'C':[1,2,3,np.nan],
                 'D':[4,5,6,7]})
df

     A    B    C  D
0  1.0  5.0  1.0  4
1  NaN  NaN  2.0  5
2  2.0  NaN  3.0  6
3  NaN  6.0  NaN  7

###  1. Drop the missing values

In [32]:
df.drop(axis=1, columns=["A","B","C"])

   D
0  4
1  5
2  6
3  7

In [43]:
df.dropna(axis=1,thresh=3)

     C  D
0  1.0  4
1  2.0  5
2  3.0  6
3  NaN  7

In [46]:
# When working with big data use:
df.dropna(axis=1,thresh=0.7*len(df)) #BEST SOLUTION

     C  D
0  1.0  4
1  2.0  5
2  3.0  6
3  NaN  7

### 2. Fill them with another value

In [44]:
df.fillna("New")

     A    B    C  D
0  1.0  5.0  1.0  4
1  New  New  2.0  5
2  2.0  New  3.0  6
3  New  6.0  New  7

In [45]:
df.fillna(value =df['A'].mean())

     A    B    C  D
0  1.0  5.0  1.0  4
1  1.5  1.5  2.0  5
2  2.0  1.5  3.0  6
3  1.5  6.0  1.5  7

In [49]:
df1 = pd.DataFrame({
    'A':[1,2,3,4],
    'B':[5,6,7,8],
    'C':[9,10,11,12],
    'D':[13,14,15,16]
})

df2 = pd.DataFrame({
    'A':[1,2,3,4],
    'B':[5,6,7,8],
    'C':[9,10,11,12],
    'D':[13,14,15,16]
})

df3 = pd.DataFrame({
    'A':[1,2,3,4],
    'B':[5,6,7,8],
    'C':[9,10,11,12],
    'D':[13,14,15,16]
})

In [52]:
frames = [df1, df2, df3]

result = pd.concat(frames, keys=["x", "y", "z"])

In [53]:
result

     A  B   C   D
x 0  1  5   9  13
  1  2  6  10  14
  2  3  7  11  15
  3  4  8  12  16
y 0  1  5   9  13
  1  2  6  10  14
  2  3  7  11  15
  3  4  8  12  16
z 0  1  5   9  13
  1  2  6  10  14
  2  3  7  11  15
  3  4  8  12  16

## Reading Data

In [64]:

data = pd.read_csv('USA_Housing.csv')

### Exploring data

In [65]:
data.head()

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price,Address
0,79545.458574,5.682861,7.009188,4.09,23086.800503,1.059034e+06,"208 Michael Ferry Apt. 674\nLaurabury, NE 3701..."
1,79248.642455,6.002900,6.730821,3.09,40173.072174,1.505891e+06,"188 Johnson Views Suite 079\nLake Kathleen, CA..."
2,61287.067179,5.865890,8.512727,5.13,36882.159400,1.058988e+06,"9127 Elizabeth Stravenue\nDanieltown, WI 06482..."
3,63345.240046,7.188236,5.586729,3.26,34310.242831,1.260617e+06,USS Barnett\nFPO AP 44820
4,59982.197226,5.040555,7.839388,4.23,26354.109472,6.309435e+05,USNS Raymond\nFPO AE 09386

In [66]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 7 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   Avg. Area Income              5000 non-null   float64
 1   Avg. Area House Age           5000 non-null   float64
 2   Avg. Area Number of Rooms     5000 non-null   float64
 3   Avg. Area Number of Bedrooms  5000 non-null   float64
 4   Area Population               5000 non-null   float64
 5   Price                         5000 non-null   float64
 6   Address                       5000 non-null   object
dtypes: float64(6), object(1)
memory usage: 273.6+ KB

In [67]:
data.describe()

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price
count,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5.000000e+03
mean,68583.108984,5.977222,6.987792,3.981330,36163.516039,1.232073e+06
std,10657.991214,0.991456,1.005833,1.234137,9925.650114,3.531176e+05
min,17796.631190,2.644304,3.236194,2.000000,172.610686,1.593866e+04
25%,61480.562388,5.322283,6.299250,3.140000,29403.928702,9.975771e+05
50%,68804.286404,5.970429,7.002902,4.050000,36199.406689,1.232669e+06
75%,75783.338666,6.650808,7.665871,4.490000,42861.290769,1.471210e+06
max,107701.748378,9.519088,10.759588,6.500000,69621.713378,2.469066e+06

In [69]:
# check null values

data.isnull().sum()

Avg. Area Income                0
Avg. Area House Age             0
Avg. Area Number of Rooms       0
Avg. Area Number of Bedrooms    0
Area Population                 0
Price                           0
Address                         0
dtype: int64